# ProfileFamType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProfileFamType Property
ParameterTypeId Class See Also
---
"Profile"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProfileFamType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProfileFamType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProfileFamType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace